{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Flow - Liu Zihe",
  "home_page_url": "https://liuzihe02.github.io/?utm_source=json_feed",
  
  
  "icon": "https://liuzihe02.github.io/img/red_sinc_hud2b2f992c71e0cf1b31a7194e454b3b4_2840_96x96_resize_box_3.png",
  "favicon": "https://liuzihe02.github.io/img/red_sinc_hud2b2f992c71e0cf1b31a7194e454b3b4_2840_96x96_resize_box_3.png",
  "authors": [
    {
      "name": "Serghei Iakovlev",
      "url": "https://twitter.com/egreps"
    }
  ],
  "language" : "en",
  "items": [
    {
      "id": "f21650dc-220d-549d-39ba-502dde8e106d",
      "url": "https://liuzihe02.github.io/flow/fasho/?utm_source=json_feed",
      "title": "Fasho",
      "summary": "five bucks Bezos?? \u0026gt;:( come back plsssss sorry my granny squad is on the way skrrt Cortis\nCortis. I may be slightly tipsy while writing this. I got kicked out for dancing too hard to this song. In my defence, I actually learnt the choreography and was on beat. I love my friends though. I recently realised maybe my family and friends really mean the world to me. Its kinda my last (?",
      "date_published": "2025-10-30T03:20:06Z"
    },
    {
      "id": "a6731e77-bc1a-59e6-395c-6add81e30008",
      "url": "https://liuzihe02.github.io/flow/swallow/?utm_source=json_feed",
      "title": "如燕",
      "summary": "A swallow, generated by GPT. 思念如燕 它飞舞舌尖 若是真爱 配尝几分苦甜 意念婆娑 时间里推磨 追随到何处才结果 燕如针线 在青空缝编 几幅女红将以泪缀点 誓言斑驳 情雾只是经过 风雨中且让我 盈步 婀娜 Olivia Ong/王俪婷\nRecently I did a pretty difficult thing. I put in alot of effort into it, and it paid off. Sure, it came with a couple of trade-offs, but it was well worth it in comparison. I tried really hard to get better at this one other thing (dance), but fell short of my own goals.",
      "date_published": "2025-10-16T03:51:34Z",
      "date_modified" : "2025-10-16T03:51:34Z"
    },
    {
      "id": "4f289a57-fa8b-524f-191b-3345a8966d45",
      "url": "https://liuzihe02.github.io/flow/fallen/?utm_source=json_feed",
      "title": "Grateful",
      "summary": "The Fallen Angel by Alexandre Cabanel (Wikipedia) Excerpt from Paradise Lost, by John Milton\nWhat though the field be lost? All is not lost; the unconquerable Will, And study of revenge, immortal hate, And courage never to submit or yield: And what is else not to be overcome? I didn\u0026rsquo;t read Paradise Lost, but I found this painting of Lucifer that was inspired by Paradise Lost somewhat soul-stirring. We see Lucifer\u0026rsquo;s intense gaze as he looks (at the viewer?",
      "date_published": "2025-07-22T23:44:25Z",
      "date_modified" : "2025-07-22T23:44:25Z"
    },
    {
      "id": "80e178f1-8ef5-5ee9-b925-4f323f4d0859",
      "url": "https://liuzihe02.github.io/flow/end/?utm_source=json_feed",
      "title": "Always The End",
      "summary": "Composed and written by Jhung\nIt\u0026rsquo;s always the end when I see things different Always the end when I see you OK last take, last take 2,3 Then you come in like this La-la-la, la-da-da Please! Don\u0026rsquo;t you forget about me, no Cause I can\u0026rsquo;t let this go Don\u0026rsquo;t forget to let me know Nowadays, a significant portion of my time and energy is channelled to dancing. One thought occurs fairly often to me recently, as I start to see frontier AI models get increasingly intertwined within the lives of the people around me.",
      "date_published": "2025-05-03T23:32:42Z"
    },
    {
      "id": "0205f8b3-3d07-5b77-d9ac-128d6a6bc331",
      "url": "https://liuzihe02.github.io/flow/dog/?utm_source=json_feed",
      "title": "The Dog",
      "summary": "I like a dog at my feet when I read, Whatever his size or whatever his breed. A dog now and then that will nuzzle my hand As though I were the greatest of men in the land, And trying to tell me it’s pleasant to be On such intimate terms with a fellow like me. I like a dog at my side when I eat, I like to give him a bit of my meat; And though mother objects and insists it is bad To let dogs in the dining room, still I am glad To behold him stretched out on the floor by my chair.",
      "date_published": "2025-04-03T15:00:10Z",
      "date_modified" : "2025-04-03T15:00:10Z"
    },
    {
      "id": "a215ede7-e3a0-5f17-590c-590b14484402",
      "url": "https://liuzihe02.github.io/flow/dream/?utm_source=json_feed",
      "title": "A Dream Is a Wish Your Heart Makes",
      "summary": "Written and composed by Mack David, Al Hoffman and Jerry Livingston\nA dream is a wish your heart makes When you\u0026rsquo;re fast asleep In dreams, you will lose your heartaches Whatever you wish for, you keep Have faith in your dreams and maybe someday Rainbow will come shining through No matter how your heart is grieving If you keep on believing Then the dream that you wish will come true The original version of this was written for the Walt Disney film Cinderella (1950).",
      "date_published": "2025-03-29T23:56:58+02:00"
    },
    {
      "id": "a1085bc8-320a-5fdb-9988-fb87bdc133f2",
      "url": "https://liuzihe02.github.io/flow/unconditional/?utm_source=json_feed",
      "title": "Unconditional",
      "summary": "Composed and written by Jaehyun\nI just, I just bought my baby Prada Got another for hеr, straight from the store Fly her \u0026lsquo;round the world so she can hang by the shore That\u0026rsquo;s my baby, that’s my sugar I don\u0026rsquo;t need no honey on the side That\u0026rsquo;s unconditiona-nal For her, I\u0026rsquo;d break the law, just take me straight to the court Buy a billion roses and I\u0026rsquo;d still get her more That\u0026rsquo;s my baby, that’s my sugar I don\u0026rsquo;t need no honey on the side That\u0026rsquo;s unconditiona-nal Alright I\u0026rsquo;ll be honest, the lyrics aren\u0026rsquo;t the most refined.",
      "date_published": "2025-03-27T23:56:58+02:00"
    }
  ]
}
